
export const CATEGORIES = [
  "لبنیات",
  "میوه و سبزیجات",
  "پروتئین و گوشت",
  "نان و غلات",
  "نوشیدنی",
  "تنقلات",
  "ادویه و چاشنی",
  "خواربار",
  "شوینده و بهداشتی",
  "محصولات منجمد",
  "حیوانات خانگی (فنسی)",
  "آرایشگاه و زیبایی",
  "پوشاک و مد",
  "بهداشت و درمان",
  "ورزش و سرگرمی",
  "تفریح و رستوران",
  "آموزش و کتاب",
  "خدمات و تعمیرات",
  "شارژ و قبوض",
  "اجاره خانه",
  "لوازم خانه",
  "خودرو و حمل‌ونقل",
  "سایر"
] as const;

export const SUPERMARKET_CATEGORIES = [
  "لبنیات",
  "میوه و سبزیجات",
  "پروتئین و گوشت",
  "نان و غلات",
  "نوشیدنی",
  "تنقلات",
  "ادویه و چاشنی",
  "خواربار",
  "شوینده و بهداشتی",
  "محصولات منجمد",
  "حیوانات خانگی (فنسی)"
];

export const PERSONAL_CATEGORIES = [
  "آرایشگاه و زیبایی",
  "پوشاک و مد",
  "بهداشت و درمان",
  "ورزش و سرگرمی",
  "تفریح و رستوران",
  "آموزش و کتاب",
  "خدمات و تعمیرات"
];

export const HOME_CATEGORIES = [
  "شارژ و قبوض",
  "اجاره خانه",
  "لوازم خانه",
  "خودرو و حمل‌ونقل",
  "سایر"
];

export const UNITS = [
  "عدد",
  "کیلوگرم",
  "گرم",
  "لیتر",
  "بطری",
  "بسته",
  "قوطی",
  "کارتن",
  "ماه",
  "دست",
  "سرویس",
  "جلسه",
  "نفر",
  "جفت"
] as const;

export const CATEGORY_COLORS: Record<string, string> = {
  "شارژ و قبوض": "#ef4444",
  "اجاره خانه": "#b91c1c",
  "حیوانات خانگی (فنسی)": "#d946ef",
  "لبنیات": "#38bdf8",
  "میوه و سبزیجات": "#4ade80",
  "پروتئین و گوشت": "#f87171",
  "نان و غلات": "#facc15",
  "نوشیدنی": "#22d3ee",
  "تنقلات": "#fb923c",
  "ادویه و چاشنی": "#a8a29e",
  "خواربار": "#a78bfa",
  "شوینده و بهداشتی": "#f472b6",
  "محصولات منجمد": "#60a5fa",
  "لوازم خانه": "#94a3b8",
  "خودرو و حمل‌ونقل": "#64748b",
  "بهداشت و درمان": "#10b981",
  "آرایشگاه و زیبایی": "#ec4899",
  "پوشاک و مد": "#8b5cf6",
  "ورزش و سرگرمی": "#f59e0b",
  "آموزش و کتاب": "#6366f1",
  "خدمات و تعمیرات": "#475569",
  "تفریح و رستوران": "#8b5cf6",
  "سایر": "#cbd5e1",
};
